### Import Libraries

In [1]:
# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import os

### Check Current Working Directory

In [1]:
#import os
os.getcwd()

In [2]:
os.listdir()

### Chage Working Directory

In [4]:
#import os
os.chdir('/f1/f2/Documents/trainings/python_programming')  # Provide the new path here

In [3]:
os.getcwd()

In [4]:
os.listdir()

In [7]:
os.chdir('/f1/f2/Documents/trainings/Python_Tutorials/Notebooks')

In [5]:
#import os
os.getcwd()

In [ ]:
#import os
#os.chdir('D:/TGS/Training/Python_Tutorials/Notebooks')  # Provide the new path here

### Load Data form a specific path

In [10]:
import pandas as pd
data = pd.read_csv('/f1/f2/Documents/trainings/ML_DataMining/mba_ar.csv')

In [11]:
data.head()

   Wine  Chips  Bread  Butter  Milk  Apple
0  Wine    NaN  Bread  Butter  Milk    NaN
1   NaN    NaN  Bread  Butter  Milk    NaN
2   NaN  Chips    NaN     NaN   NaN  Apple
3  Wine  Chips  Bread  Butter  Milk  Apple
4  Wine  Chips    NaN     NaN  Milk    NaN

### Load data from Current Directory

In [12]:
#import pandas as pd
dataset = pd.read_csv('Data.csv')
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [6]:
xldata = pd.read_excel('employees.xlsx', sheet_name='Sheet1')
#xldata.head()

#### Check leangth of a dataframe i.e., dataset

In [14]:
len(dataset)

10

In [15]:
len(data)

21

In [16]:
len(xldata)

106

In [17]:
len(dataset.columns)

4

In [19]:
len(xldata.columns)

11

In [20]:
dataset.shape

(10, 4)

In [22]:
xldata.shape

(106, 11)

In [24]:
xldata

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000,NaN,100,90.0
1,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000,NaN,100,90.0
2,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000,NaN,102,60.0
3,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000,NaN,103,60.0
4,105,David,Austin,DAUSTIN,590.423.4569,1997-06-25,IT_PROG,4800,NaN,103,60.0
...,...,...,...,...,...,...,...,...,...,...,...
101,202,Pat,Fay,PFAY,603.123.6666,1997-08-17,MK_REP,6000,NaN,201,20.0
102,203,Susan,Mavris,SMAVRIS,515.123.7777,1994-06-07,HR_REP,6500,NaN,101,40.0
103,204,Hermann,Baer,HBAER,515.123.8888,1994-06-07,PR_REP,10000,NaN,101,70.0
104,205,Shelley,Higgins,SHIGGINS,515.123.8080,1994-06-07,AC_MGR,12000,NaN,101,110.0
105,206,William,Gietz,WGIETZ,515.123.8181,1994-06-07,AC_ACCOUNT,8300,NaN,205,110.0

In [25]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

#### Check dataframe columns

In [26]:
dataset.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

### Check data types of the dataframe

In [27]:
dataset.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [28]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

#### to check a specific column's data type in a dataframe

In [29]:
dataset.Age.dtype

dtype('float64')

### To check top rows of a data frame

In [30]:
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

### To check last rows of a dataframe

In [31]:
dataset.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

### Filter one specific column of a dataframe

In [33]:
dataset['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

### Filter two specific columns of a dataframe

In [36]:
dataset[["Age", "Salary", "Purchased"]]

    Age   Salary Purchased
0  44.0  72000.0        No
1  27.0  48000.0       Yes
2  30.0  54000.0        No
3  38.0  61000.0        No
4  40.0      NaN       Yes
5  35.0  58000.0       Yes
6   NaN  52000.0        No
7  48.0  79000.0       Yes
8  50.0  83000.0        No
9  37.0  67000.0       Yes

### To check unique values of a given column name of a dataframe

In [37]:
dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [38]:
dataset.Purchased.unique()

array(['No', 'Yes'], dtype=object)

In [39]:
dataset.Age.unique()

array([44., 27., 30., 38., 40., 35., nan, 48., 50., 37.])

In [40]:
dataset.Age.mean()

38.77777777777778

In [41]:
dataset.Salary.mean()

63777.77777777778

In [42]:
dataset.Salary.median()

61000.0

In [43]:
dataset.Age.median()

38.0

In [44]:
dataset.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [45]:
dataset.Country.value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [46]:
dataset.Purchased.value_counts()

No     5
Yes    5
Name: Purchased, dtype: int64

In [47]:
dataset.Country.value_counts(normalize=True)

France     0.4
Spain      0.3
Germany    0.3
Name: Country, dtype: float64

In [48]:
dataset.Purchased.value_counts(normalize=True)

No     0.5
Yes    0.5
Name: Purchased, dtype: float64

### To check null values present or not in a dataframe

##### null values may present in any row or column

In [49]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [50]:
dataset.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [51]:
dataset.isnull().any().any()

True

In [52]:
dataset.isnull().values.any()

True

### To check total number of null values in a dataframe

In [53]:
dataset.isnull().values.sum()

2

In [54]:
dataset.isnull().sum().sum()

2

### To check row wise/column wise null values present or not for a given dataframe

In [ ]:
dataset.isnull()

#### To check column wise null values present or not

In [55]:
dataset.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [56]:
dataset.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

#### Count column wise no. of null values

In [57]:
dataset.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

### Filter the rows which have null vlues for all the columns for a given dataframe

In [58]:
nullobj = dataset[dataset.isnull().any(axis=1)]

In [59]:
nullobj

   Country   Age   Salary Purchased
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No

### Replace Null values by passing a key-value object for a given dataframe

In [60]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [61]:
dataset.Age.mean(), dataset.Salary.mean()

(38.77777777777778, 63777.77777777778)

In [63]:
round(dataset.Age.mean(),2)

38.78

In [64]:
dataset1 = dataset.fillna({"Age": round(dataset.Age.mean(),2), 
                           "Salary": round(dataset.Salary.mean(),2)})

In [65]:
dataset1

   Country    Age    Salary Purchased
0   France  44.00  72000.00        No
1    Spain  27.00  48000.00       Yes
2  Germany  30.00  54000.00        No
3    Spain  38.00  61000.00        No
4  Germany  40.00  63777.78       Yes
5   France  35.00  58000.00       Yes
6    Spain  38.78  52000.00        No
7   France  48.00  79000.00       Yes
8  Germany  50.00  83000.00        No
9   France  37.00  67000.00       Yes

### How to assign labels to text values in a dataframe?

##### Create a key-value object for assigning labels

In [66]:
assign_label = {"Purchased":     {"Yes": 1, "No": 0},
                "Country": {"France": 0, "Spain": 1, "Germany": 2 }}

##### Replace text values by passing assign_label key-value object

In [67]:
dataset1

   Country    Age    Salary Purchased
0   France  44.00  72000.00        No
1    Spain  27.00  48000.00       Yes
2  Germany  30.00  54000.00        No
3    Spain  38.00  61000.00        No
4  Germany  40.00  63777.78       Yes
5   France  35.00  58000.00       Yes
6    Spain  38.78  52000.00        No
7   France  48.00  79000.00       Yes
8  Germany  50.00  83000.00        No
9   France  37.00  67000.00       Yes

In [68]:
dataset1.replace(assign_label, inplace=True)

In [69]:
dataset1

   Country    Age    Salary  Purchased
0        0  44.00  72000.00          0
1        1  27.00  48000.00          1
2        2  30.00  54000.00          0
3        1  38.00  61000.00          0
4        2  40.00  63777.78          1
5        0  35.00  58000.00          1
6        1  38.78  52000.00          0
7        0  48.00  79000.00          1
8        2  50.00  83000.00          0
9        0  37.00  67000.00          1

In [70]:
dataset1.to_csv('processed_fie.csv', index=False)

### Create Dummy Variables for Categorical features in a dataframe

In [ ]:
France 0      0 0 0
Spain 1       0 0 1
Germany 2     0 1 0

In [ ]:
#pd.get_dummies(dataset, columns=["Country"])
pd.get_dummies(dataset, columns=["Country","Purchased"])

In [ ]:
dataset_original.head()

#### Create Dummy Variables for multiple columns with prefix

In [ ]:
pd.get_dummies(dataset, columns=["Country", "Purchased"]).head()

In [ ]:
pd.get_dummies(dataset, columns=["Country", "Purchased"], prefix=["Coun", "Pur"]).head()

In [ ]:
dataset

### Using SK Learn preprocessing

##### labeling text data

In [ ]:
from sklearn.preprocessing import LabelEncoder

assign_labl = LabelEncoder()
dataset["Country_label"] = assign_labl.fit_transform(dataset["Country"])

In [ ]:
assign_labl = LabelEncoder()
dataset["Purchsed_label"] = assign_labl.fit_transform(dataset["Purchased"])

In [ ]:
dataset

In [ ]:
dataset_original

##### Greating a Dummy Variables for categorical features

In [ ]:
from sklearn.preprocessing import LabelBinarizer

country_label = LabelBinarizer()
lb_results = country_label.fit_transform(dataset["Country"])
country_lables = pd.DataFrame(lb_results, columns=country_label.classes_)

In [ ]:
country_label.classes_

In [ ]:
lb_results

In [ ]:
country_lables

### Concatinate two dataframes

In [ ]:
new_df = pd.concat([dataset, country_lables], axis=1)
new_df.head()

In [ ]:
new_df.dtypes

### How to append one dataframe to the another with same column names?

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[0, 1, 2, 3])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[0, 1, 2, 3])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

In [ ]:
#frames = [df1, df2, df3]
result1 = pd.concat([df1, df2, df3], axis=0)
result1

In [ ]:
df = df1.append(df2)

In [ ]:
df

In [ ]:
df = df.append(df3)
df

### Describe a given dataframe

In [ ]:
dataset

In [ ]:
dataset.describe()

In [ ]:
dataset['Age'].mean()

In [ ]:
dataset['Salary'].mean()

In [ ]:
dataset['Age'].median()

In [ ]:
dataset['Salary'].median()

In [ ]:
dataset['Country'].mode()

In [ ]:
dataset['Country'].mode()[0]

In [ ]:
dataset['Age'].std()

In [ ]:
dataset['Salary'].std()

In [ ]:
dataset['Age'].mode()[0]

In [ ]:
dataset

In [ ]:
dataset['Salary'].mode()[0]

### Frequency of categorical features

In [ ]:
dataset[dataset.isnull().any(axis=1)]

In [ ]:
dataset = dataset.fillna({"Age": 38, "Salary": 61000})

##### Frequency of a categorical data

In [ ]:
dataset['Country'].value_counts(normalize=True)

In [ ]:
dataset['Age'].value_counts()

In [ ]:
dataset['Salary'].value_counts()

### Groupby operations for a given dataframe

In [ ]:
dataset.groupby(['Country', 'Purchased']).sum()

In [ ]:
dataset.groupby(['Country', 'Purchased']).mean()

### Cross Tabulation for a given dataframe

In [ ]:
pd.crosstab(dataset.Country, dataset.Purchased,margins=True)

In [ ]:
pd.crosstab(dataset.Country, dataset.Age,margins=True)

In [ ]:
pd.crosstab([dataset.Country, dataset.Purchased],dataset.Age, margins=True)

### Filter a dataframe based on a range of values

In [ ]:
dataset[(dataset['Age'] >= 20) & (dataset['Age']<=40)]

### Filter a dataframe based on either - or scenario

#### Filter based on one category value

In [ ]:
dataset[(dataset['Country'] == 'Spain')]

In [ ]:
dataset[(dataset['Country'] == 'France') | (dataset['Country'] == 'Germany')]

In [ ]:
dataset[dataset['Salary']<=66000]

### Create Groups in a dataframe

In [ ]:
dataset.describe()

In [ ]:
dataset['age_group'] = pd.cut(x=dataset['Age'], bins=[20, 29, 39, 49, 59], labels=['20s', '30s', '40s', '50s'])

In [ ]:
dataset

In [ ]:
dataset['age_group'].value_counts(normalize=True)

### How to write file to desk?

In [ ]:
dataset

In [ ]:
dataset.to_csv('dataset_processed.csv', sep='\t', index=False)

In [ ]:
dataset.to_csv('dataset_processed.txt', sep='\t', index=False)

In [ ]:
dataset.to_csv('dataset_processed_normal.txt', index=False)

In [ ]:
dataset.to_csv('dataset_processed_normalcsv.csv', index=False)

### How to read files?

In [ ]:
read_txtfile = pd.read_csv('dataset_processed.txt', sep='\t')

In [ ]:
read_txtfile.head(2)

In [ ]:
read_csvfile = pd.read_csv('dataset_processed.csv', sep='\t')
read_csvfile.head(2)

In [ ]:
read_normal = pd.read_csv('dataset_processed.csv')
read_normal.head(2)

In [ ]:
read_normal = pd.read_csv('dataset_processed_normalcsv.csv')
read_normal.head(2)

In [ ]:
read_txtnormal = pd.read_csv('dataset_processed_normal.txt')
read_txtnormal.head(2)

## Data Visualization

#### Using Pandas

##### Histogram

In [ ]:
dataset.hist(column='Age')

In [ ]:
dataset.hist(column='Salary')

In [ ]:
#dataset.hist(column='Country')

##### Bar chart

In [ ]:
dataset['Country'].value_counts().plot(kind='bar')

In [ ]:
dataset['Purchased'].value_counts().plot(kind='bar')

In [ ]:
dataset['Age'].plot(kind='bar')

plt.minorticks_on()
plt.grid(which='major', linestyle='-', linewidth='0.5', color='green')
plt.grid(which='minor', linestyle=':', linewidth='0.5', color='black')

plt.show()

In [ ]:
dataset['Age'].plot(kind='bar')

plt.minorticks_on()
plt.grid(which='major', linestyle='-', linewidth='0.5', color='green')
plt.grid(which='minor', linestyle=':', linewidth='0.5', color='black')

plt.show()

###### Line graph

In [ ]:
stock = pd.DataFrame({
       'icici': [20, 18, 489, 675, 1776, 900],
       'hdfc': [4, 25, 281, 600, 1900, 1300]
        }, index=[1990, 1997, 2003, 2009, 2015, 2020])

In [ ]:
stock

In [ ]:
stock.plot.line()

In [ ]:
stock.plot.line(subplots=True)
#type(axes)

##### Boxplot

In [ ]:
np.random.seed(1234)
df = pd.DataFrame(np.random.randn(100, 4),
                  columns=['samsung', 'RealMe', 'RedMe', 'Nokia'])
df

In [ ]:
type(df)

In [ ]:
df.head(2)

In [ ]:
df.boxplot(column=['samsung', 'RealMe', 'RedMe', 'Nokia'])

In [ ]:
stock.boxplot(column=['icici', 'hdfc'])

## Data Visualization using Matplotlib

In [ ]:
import matplotlib.pyplot as plt
plt.style.use('classic')
%matplotlib inline
import numpy as np
import pandas as pd

In [ ]:
# Create some data
rng = np.random.RandomState(0)
x = np.linspace(0, 10, 500)
y = np.cumsum(rng.randn(500, 6), 0)

In [ ]:
type(x)

In [ ]:
type(y)

In [ ]:
x[1:5]

In [ ]:
min(x), max(x), #min(y), max(y)

In [ ]:
x

In [ ]:
y

In [ ]:
plt.plot(x, y)
plt.legend('ABCDEF', ncol=3, loc='upper left');

## Using Seaborn

In [ ]:
import seaborn as sns
sns.set()

In [ ]:
# same plotting code as above!
plt.plot(x, y)
plt.legend('ABCDEF', ncol=2, loc='upper left');

In [ ]:
data = np.random.multivariate_normal([0, 0], [[5, 2], [2, 2]], size=2000)
data = pd.DataFrame(data, columns=['x', 'y'])

In [ ]:
data.shape

In [ ]:
data.head(2)

In [ ]:
for col in 'xy':
    plt.hist(data[col], alpha=0.5)

In [ ]:
for col in 'xy':
    sns.kdeplot(data[col], shade=True)

In [ ]:
sns.distplot(data['x'])
sns.distplot(data['y'])

In [ ]:
sns.kdeplot(data['x'])
sns.kdeplot(data['y'])

In [ ]:
tips = sns.load_dataset('tips')
tips.head()

In [ ]:
# tip percentage
tips['tip_pct'] = 100 * tips['tip'] / tips['total_bill']

grid = sns.FacetGrid(tips, row="sex", col="time", margin_titles=True)
grid.map(plt.hist, "tip_pct", bins=np.linspace(0, 40, 15));

In [ ]:
with sns.axes_style(style='ticks'):
    g = sns.factorplot("day", "total_bill", "sex", data=tips, kind="box")
    g.set_axis_labels("Day", "Total Bill");

In [ ]:
sns.jointplot("total_bill", "tip", data=tips, kind='reg');

In [ ]:
sns.violinplot("sex", "tip", data=tips,
               palette=["lightblue", "lightpink"]);